sistema/app/views/candidatos/show.html.erb

SELECT "formacoes_academicas".* FROM "formacoes_academicas" WHERE "formacoes_academicas"."pessoa_fisica_id" = ?  [["pessoa_fisica_id", 1]]
---
      </tr>
  <% @pessoa_fisica.formacoes_academicas.each do |formacao_academica|%>

SELECT "experiencias_profissionais".* FROM "experiencias_profissionais" WHERE "experiencias_profissionais"."pessoa_fisica_id" = ?  [["pessoa_fisica_id", 1]]
---
      </tr>
  <% @pessoa_fisica.experiencias_profissionais.each do |experiencia_profissional|%>