app/controllers/linguas_controller.rb

SELECT "linguas".* FROM "linguas"
---
  def index
    @linguas = Lingua.all

INSERT INTO "linguas" ("descricao", "created_at", "updated_at") VALUES (?, ?, ?)  [["descricao", "Ingles"], ["created_at", "2015-07-09 16:38:26.278512"], ["updated_at", "2015-07-09 16:38:26.278512"]]
---
  def create
    @lingua = Lingua.new(lingua_params)

    respond_to do |format|
      if @lingua.save

SELECT  "linguas".* FROM "linguas" WHERE "linguas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_lingua
      @lingua = Lingua.find(params[:id])