app/controllers/pessoas_juridicas_controller.rb

SELECT "municipios".* FROM "municipios" WHERE "municipios"."unidade_federativa_id" = ?  [["unidade_federativa_id", 0]]
---
  def new
    @pessoa_juridica = PessoaJuridica.new
    @unidades_federativas = UnidadeFederativa.all
    @municipios = Municipio.where(unidade_federativa_id: 0)