app/controllers/sessions_controller.rb

    def create
      @usuario = Usuario.find_by_login(params[:session][:login])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."login" = ? LIMIT 1  [["login", "contratante"]]