app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("login", "password_digest", "papel", "status") VALUES (?, ?, ?, ?)  [["login", "candidato"], ["password_digest", "$2a$10$lMBVQ6Q.pO3oyQLJZTHNKujwdg/UoOQzSd2Q2FKOYbbXLcy0twOlq"], ["papel", "candidato"], ["status", "t"]]
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save