sistema/app/controllers/candidatos_controller.rb

SELECT "municipios".* FROM "municipios" WHERE "municipios"."unidade_federativa_id" = ?  [["unidade_federativa_id", 0]]
SELECT "linguas".* FROM "linguas"
---
  def new
    @candidato = Candidato.new
    @unidades_federativas = UnidadeFederativa.all
    @municipios = Municipio.where(unidade_federativa_id: 0)
    @id = "new_candidato"
    @url = candidatos_path
    @classe = "new_candidato"
    @niveis = Nivel.all
    @linguas = Lingua.all

SELECT "municipios".* FROM "municipios" WHERE "municipios"."unidade_federativa_id" = ?  [["unidade_federativa_id", 0]]
SELECT "linguas".* FROM "linguas"
---
  def edit
    @unidades_federativas = UnidadeFederativa.all
    @municipios = Municipio.where(unidade_federativa_id: 0)
    @id = "edit_candidato_" + @candidato.id.to_s
    @url = candidato_path(@candidato)
    @classe = "edit_candidato"
    @niveis = Nivel.all
    @linguas = Lingua.all