sistema/app/controllers/candidaturas_controller.rb

SELECT "vagas".* FROM "vagas"
---
  def home
    @vagas = Vaga.all

SELECT "municipios".* FROM "municipios" WHERE "municipios"."unidade_federativa_id" = ?  [["unidade_federativa_id", 0]]
---
  def edit
    @faixas_salariais = FaixaSalarial.all
    @unidades_federativas = UnidadeFederativa.all
    @municipios = Municipio.where(unidade_federativa_id: 0)

SELECT  "pessoas".* FROM "pessoas" WHERE "pessoas"."type" IN ('Candidato') AND "pessoas"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "vagas".* FROM "vagas" WHERE "vagas"."id" = ? LIMIT 1  [["id", nil]]
---
  def create
    @pessoa_fisica_vaga = PessoaFisicaVaga.new(pessoa_fisica_vaga_params)
    @pessoa_fisica_vaga.pessoa_fisica = PessoaFisica.find(1)

SELECT  "vagas".* FROM "vagas" WHERE "vagas"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "vagas" WHERE "vagas"."id" = ?  [["id", 1]]
---
  def destroy
    @pessoa_fisica_vaga = PessoaFisicaVaga.find(params[:id])
    @pessoa_fisica_vaga.destroy

SELECT  "vagas".* FROM "vagas" WHERE "vagas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_vaga
      @vaga = Vaga.find(params[:id])