sistema/app/controllers/municipios_controller.rb

  def index
    @municipios = Municipio.all
---
SELECT "municipios".* FROM "municipios"

  def create
    @municipio = Municipio.new(municipio_params)

    respond_to do |format|
      if @municipio.save
---
INSERT INTO "municipios" ("nome", "unidade_federativa_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nome", "1 cidade"], ["unidade_federativa_id", 1], ["created_at", "2015-07-09 16:36:56.362016"], ["updated_at", "2015-07-09 16:36:56.362016"]]

  def update
    respond_to do |format|
      if @municipio.update(municipio_params)
---
UPDATE "municipios" SET "unidade_federativa_id" = ?, "updated_at" = ? WHERE "municipios"."id" = ?  [["unidade_federativa_id", 2], ["updated_at", "2015-07-09 18:07:39.723645"], ["id", 1]]

    def set_municipio
      @municipio = Municipio.find(params[:id])
---
SELECT  "municipios".* FROM "municipios" WHERE "municipios"."id" = ? LIMIT 1  [["id", 1]]