sistema/app/controllers/pessoas_fisicas_controller.rb

SELECT "municipios".* FROM "municipios" WHERE "municipios"."unidade_federativa_id" = ?  [["unidade_federativa_id", 1]]
---
  def getMunicipios
    val = params[:uf]
    #Use val to find records
    options = Municipio.where(unidade_federativa_id: val).collect{|x| '["' + x.id.to_s + '" , "' + x.nome + '"]'}