sistema/app/controllers/questionarios_controller.rb

  def index
    @questionarios = Questionario.where(vaga_id: @vaga.id)
---
SELECT "questionarios".* FROM "questionarios" WHERE "questionarios"."vaga_id" = ?  [["vaga_id", 1]]

  def create
    @questionario = Questionario.new(questionario_params)

    respond_to do |format|
      if @questionario.save
---
INSERT INTO "questionarios" ("descricao", "vaga_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["descricao", "qu1"], ["vaga_id", 1], ["created_at", "2015-07-14 22:30:23.610509"], ["updated_at", "2015-07-14 22:30:23.610509"]]

    def set_questionario
      @questionario = Questionario.find(params[:id])
---
SELECT  "questionarios".* FROM "questionarios" WHERE "questionarios"."id" = ? LIMIT 1  [["id", 1]]

    def set_vaga
      @vaga = Vaga.find(params[:id])
---
SELECT  "vagas".* FROM "vagas" WHERE "vagas"."id" = ? LIMIT 1  [["id", 1]]