sistema/app/controllers/vagas_controller.rb

  def index
    @vagas = Vaga.all
---
SELECT "vagas".* FROM "vagas"

  def home
    @vagas = Vaga.all
---
SELECT "vagas".* FROM "vagas"

  def new
    @vaga = Vaga.new
    @contratante = @current_user
    @faixas_salariais = FaixaSalarial.all
    @unidades_federativas = UnidadeFederativa.all
    @municipios = Municipio.where(unidade_federativa_id: 0)
---
SELECT "municipios".* FROM "municipios" WHERE "municipios"."unidade_federativa_id" = ?  [["unidade_federativa_id", 0]]

  def create
    @vaga = Vaga.new(vaga_params)

    respond_to do |format|
      if @vaga.save
---
INSERT INTO "vagas" ("contratante_id", "faixa_salarial_id", "cidade_id", "quantidade", "cargo", "descricao", "data_cadastro", "data_inicio_inscricao", "data_termino_inscricao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_vaga
      @vaga = Vaga.find(params[:id])
---
SELECT  "vagas".* FROM "vagas" WHERE "vagas"."id" = ? LIMIT 1  [["id", 1]]